# Lab for data manipulation
Required packages:

- `pandas`
- `seaborn`
- `pandasql`

In [1]:
import pandas as pd
import pandasql as ps

## Load datasets

In [2]:
ship_flag = pd.read_csv("data/ship_flag.csv")
ship_sunk = pd.read_csv("data/ship_sunk.csv")

pysqldf = lambda q: sqldf(q, globals())

## Manipulate data using SQL

In [3]:
ps.sqldf("SELECT ship_flag.Ship from ship_flag")

                         Ship
0     Black Assarca shipwreck
1                  Globe Star
2                     Gulland
3                     Mtongwe
4                    Katina P
...                       ...
3724    Sovereign of the Seas
3725                    Takao
3726                    U-181
3727                    U-859
3728                    U-862

[3729 rows x 1 columns]

In [4]:
ps.sqldf("""SELECT ship_flag.Ship, ship_sunk.Coordinates
         FROM ship_flag
         INNER JOIN ship_sunk ON ship_flag.Ship = ship_sunk.Ship""")

                         Ship             Coordinates
0     Black Assarca shipwreck                    None
1                  Globe Star    4°04′54″S 39°43′12″E
2                     Gulland   04°02′50″S 39°43′57″E
3                     Mtongwe                    None
4                    Katina P         25°35′S 32°59′E
...                       ...                     ...
3723    Sovereign of the Seas                    None
3724                    Takao  03°05′05″N 100°41′00″E
3725                    U-181   3°05′50″N 100°42′50″E
3726                    U-859   5°46′01″N 100°04′01″E
3727                    U-862         3°05′N 100°38′E

[3728 rows x 2 columns]

## Manipulate data using pandas

## Plotting data using seaborn